{"id": "0", "text": "Family visas: apply, extend or switch\n1. Overview\nYou need a family visa to live with a family member in the UK for more than 6 months.\nApplying from outside the UK\nYou can apply for a family visa to live with your:\n• spouse or partner\n• ﬁancé, ﬁancée or proposed civil partner\n• child\n• parent\n• relative who’ll provide long-term care for you\nIf you’re visiting the UK for 6 months or less, check if you need a Standard Visitor visa or\nMarriage Visitor visa (/check-uk-visa).\nExtending your family visa", "metadata": {}}
{"id": "1", "text": "You can apply to extend your stay with your family member if you’re already in the UK on a family\nvisa.\nYou can extend at any time before your current permission to stay in the UK expires.\nIf you’re extending to stay with the same family member, you’ll only get up to 28 days left on your\ncurrent stay added to your new visa.\nYou must live in the UK for a certain amount of time before you’re eligible for settlement\n(‘indeﬁnite leave to remain’). Before you extend your visa, check how much time you need to\nsettle in the UK (/settle-in-the-uk).\nYou might be able to apply to stay on the basis of your private life (/uk-family-visa/private-life) if\nyou’ve lived in the UK for many years already.\nSwitching to a family visa\nIf you came to the UK on a diﬀerent visa, you might be able to switch to a family visa to stay with\nyour:\n• spouse or partner\n• child\n• parent\nYou can switch at any time before your current permission to stay in the UK expires.", "metadata": {}}
{"id": "2", "text": "You might be able to apply to stay on the basis of your private life (/uk-family-visa/private-life) if\nyou’ve lived in the UK for many years already.\nSwitching to a family visa\nIf you came to the UK on a diﬀerent visa, you might be able to switch to a family visa to stay with\nyour:\n• spouse or partner\n• child\n• parent\nYou can switch at any time before your current permission to stay in the UK expires.\nFees\nHow much it costs depends on who you’re joining and how you apply.", "metadata": {}}
{"id": "3", "text": "Apply outside the\nUK\nApply in the UK\nCost if joining your partner, parent or child £1,938 £1,321\nCost for each dependant added to your\napplication\n£1,938 each person £1,321 each\nperson\nCost for adults who need to be looked after by a relative\nHow much it costs depends on what permission your relative has.\nIf they have temporary ‘protection status’ (permission to stay as a refugee or with humanitarian\nprotection) it costs:\n• £424 if you’re applying from outside the UK\n• £1,321 if you’re applying from inside the UK\nOtherwise, it costs:\n• £3,413 if you’re applying from outside the UK\n• £1,321 if you’re applying from inside the UK\nLet your bank know that a large amount of money will be coming out of your account -\notherwise it might cancel your payment.\nIf you cannot pay the fee, you may be eligible for a fee waiver in certain situations - for example if\nyou cannot aﬀord a place to live or your essential living costs.", "metadata": {}}
{"id": "4", "text": "Healthcare surcharge\nYou might also need to pay the healthcare surcharge (/healthcare-immigration-application) as part of\nyour application.\nFor each adult (18 or older) it costs:\n• £2,587.50 if you’re staying for 2 years and 6 months\n• £3,105 if you’re staying for 2 years and 9 months\n• £5,175 if you’re staying for 5 years\nFor each child (under 18), it costs:\n• £1,940 if you’re staying for 2 years and 6 months\n• £2,328 if you’re staying for 2 years and 9 months\n• £3,880 if you’re staying for 5 years\nGet a faster decision on your application\nIf you’re applying from the UK, you may be able to pay an extra £1,000 for the super priority\nservice to get a faster decision.\nYou cannot use the super priority service if you’re applying as an adult coming to be cared for by a\nrelative.", "metadata": {}}
{"id": "5", "text": "You cannot use the super priority service if you’re applying as an adult coming to be cared for by a\nrelative.\nIf you were the victim of domestic abuse or your partner died\nYou might be able to apply to settle in the UK (/settle-in-the-uk) if you had permission to stay in the", "metadata": {}}
{"id": "6", "text": "UK as a partner when either:\n• you were the victim of domestic abuse\n• your partner died\nWhen you cannot get a family visa\nIn some circumstances you cannot apply for, or switch to, a family visa.\nYour family member has a work visa or student visa\nYou cannot apply for a family visa if your family member is in the UK temporarily on a work visa (/\nbrowse/visas-immigration/work-visas) or student visa (/browse/visas-immigration/student-visas).\nYou can apply to stay with them as a dependant instead.", "metadata": {}}
{"id": "7", "text": "Your family member has a work visa or student visa\nYou cannot apply for a family visa if your family member is in the UK temporarily on a work visa (/\nbrowse/visas-immigration/work-visas) or student visa (/browse/visas-immigration/student-visas).\nYou can apply to stay with them as a dependant instead.\nYou have a visitor visa or a visa for 6 months or less\nYou’ll usually need to leave the UK to apply for a family visa if either:\n• you have permission to be in the UK as a visitor\n• your visa is for 6 months or less\nHowever, you might be able to switch to a family visa in the UK if you have either:\n• a 6-month family visa as a ﬁancé, ﬁancée or proposed civil partner (/uk-family-visa/partner-spouse)\n• permission to stay in the UK for the outcome of a family court case or divorce", "metadata": {}}
{"id": "8", "text": "2. Apply as a partner or spouse\nT o apply as a partner, you and your partner both need to be 18 or over.\nYour partner must also either:\n• be a British or Irish citizen\n• have settled in the UK - for example, they have indeﬁnite leave to remain, settled status or proof\nof permanent residence\n• be from the EU, Switzerland, Norway, Iceland or Liechtenstein and have pre-settled status (/\nsettled-status-eu-citizens-families/what-settled-and-presettled-status-means) - they must have started\nliving in the UK before 1 January 2021\n• have a T urkish Businessperson visa (/turkish-business-person) or T urkish Worker visa (/turkish-\nworker)\n• have protection status (leave to remain as a refugee, permission to stay as a refugee or a\nperson with humanitarian protection)\n• have got permission to stay as a stateless person before you became their partner\nYou and your partner must intend to live together permanently in the UK after you apply.", "metadata": {}}
{"id": "9", "text": "If your partner has settled or pre-settled status you may be able to apply to the free EU\nSettlement Scheme (/settled-status-eu-citizens-families/eligibility).\nWhat you’ll need to prove\nYou must be able to prove one of the following:\n• you’re in a civil partnership or marriage that’s recognised in the UK", "metadata": {}}
{"id": "10", "text": "• you’ve been living together in a relationship for at least 2 years when you apply\n• you are a ﬁancé, ﬁancée or proposed civil partner and will marry or enter into a civil partnership\nin the UK within 6 months of arriving\n• you’ve been in a relationship for at least 2 years when you apply but you cannot live together,\nfor example because you’re working or studying in diﬀerent places, or it’s not accepted in your\nculture\nYou also need to prove you:\n• have a good knowledge of English (/uk-family-visa/knowledge-of-english)\n• meet the ﬁnancial requirements (/uk-family-visa/proof-income-partner)\nIf you cannot provide this proof you may still be able to apply for a visa or extend your permission\nto stay if:\n• you have a child in the UK who is a British or Irish citizen or has lived in the UK for 7 years and it\nwould be unreasonable for them to leave the UK\n• it would breach your human rights (https://www.equalityhumanrights.", "metadata": {}}
{"id": "11", "text": "equalityhumanrights.com/en/human-rights/what-are-\nhuman-rights) to stop you coming to the UK or make you leave\nIf you’re applying as a ﬁancé, ﬁancée or proposed civil partner\nYou must prove that: \n• you plan to marry or become civil partners within 6 months of arriving in the UK\n• any previous marriages or civil partnerships have ended\nYou cannot work or study in the UK during your engagement. After you marry or become civil\npartners, you’ll need to apply to extend your stay in the UK. If your application is approved, you’ll", "metadata": {}}
{"id": "12", "text": "have the right to work or study.\nHow to prove your relationship\nSend evidence that:\n• comes from the government, a bank, landlord, utility provider, or a medical professional\n• conﬁrms your relationship with your partner - for example, that you live together, share\nexpenses or are married or in a civil partnership\n• is less than 4 years old\nYou can use things like:\n• a marriage certiﬁcate or civil partnership certiﬁcate\n• a tenancy agreement, utility bills or Council T ax bills conﬁrming that you live at the same\naddress or pay bills together\n• a bank statement from a joint bank account, or conﬁrming that you live at the same address\n• a letter from your doctor or dentist conﬁrming that you live at the same address\nIf you do not have any evidence that meets these criteria, there is other evidence you can provide\ninstead,", "metadata": {}}
{"id": "13", "text": "utility bills or Council T ax bills conﬁrming that you live at the same\naddress or pay bills together\n• a bank statement from a joint bank account, or conﬁrming that you live at the same address\n• a letter from your doctor or dentist conﬁrming that you live at the same address\nIf you do not have any evidence that meets these criteria, there is other evidence you can provide\ninstead, including:\n• a one-oﬀ bill like vet’s fees or home repair costs\n• letters conﬁrming you and your partner are on the voting register for the same address\n• student ﬁnance paperwork conﬁrming that you live at the same address\nIf you do not live together", "metadata": {}}
{"id": "14", "text": "If you cannot live together because of work or study, or for cultural reasons, you’ll need to prove\nthat you have an ongoing commitment to each other. You can do this by providing evidence that\nyou:\n• communicate regularly with each other  \n• support each other ﬁnancially  \n• care for any children you have together  \n• spend time together as a couple, for example on holiday or at events\nHow long you can stay\nYou can stay in the UK for 2 years and 9 months. After this, you’ll need to apply to extend your\nstay.\nIf you’re applying as a ﬁancé, ﬁancée or proposed civil partner\nYou can stay in the UK for 6 months. After you marry or become civil partners, you’ll need to apply\nto extend your stay.\nExtend or switch to this visa\nIf you extend your family visa or switch to this visa you can stay in the UK for a further 2 years and\n6 months.\nYou can extend your visa more than once.\nIf you become engaged before extending your visa", "metadata": {}}
{"id": "15", "text": "If you’re in the UK as an unmarried partner and you become engaged, do not apply to extend your\nvisa as a ﬁancé, ﬁancée or proposed civil partner. Apply to extend with the same visa status you\nhave now.\nHow to apply\nYou’ll need to prepare information and evidence (/uk-family-visa/provide-information) to provide with\nyour application.\nHow you apply depends on whether you’re in the UK or not.\nOutside the UK\nYou must apply online from outside the UK (https://visas-immigration.service.gov.uk/apply-visa-type/\nappendixfm).\nIn the UK\nYou must apply online in the UK (https://visas-immigration.service.gov.uk/product/family-routes).\nIf you cannot pay the fee\nYou can apply for a fee waiver if you cannot pay the fee because you:\n• do not have a place to live and cannot aﬀord one\n• have a place to live but cannot aﬀord essential living costs like food or heating\n• have a very low income and paying the fee would harm your child’s wellbeing", "metadata": {}}
{"id": "16", "text": "Apply for a fee waiver online from outside the UK (https://visas-immigration.service.gov.uk/product/fee-\nwaiver).\nApply for a fee waiver online from inside the UK (https://www.gov.uk/visa-fee-waiver-in-uk).\nGet help to apply online\nYou can get help with completing the online visa application form (/assisted-digital-help-online-\napplications) if you:\n• do not feel conﬁdent using a computer or mobile device\n• do not have internet access\nYou can only use this service if you’re applying in the UK.\nYou cannot get immigration advice through this service.\nHow long it takes\nIf you apply outside the UK you’ll usually get a decision within 12 weeks.\nIf you apply inside the UK and you meet the ﬁnancial requirements (/uk-family-visa/proof-income-\npartner) and English language requirements (/uk-family-visa/knowledge-of-english), you’ll usually get a\ndecision within 8 weeks.", "metadata": {}}
{"id": "17", "text": "You cannot get immigration advice through this service.\nHow long it takes\nIf you apply outside the UK you’ll usually get a decision within 12 weeks.\nIf you apply inside the UK and you meet the ﬁnancial requirements (/uk-family-visa/proof-income-\npartner) and English language requirements (/uk-family-visa/knowledge-of-english), you’ll usually get a\ndecision within 8 weeks.\nIf you apply inside the UK and you do not meet the ﬁnancial requirements and English language\nrequirements, it currently takes about 12 months to get a decision.", "metadata": {}}
{"id": "18", "text": "You may be able to pay for a faster decision (/faster-decision-visa-settlement).\nApplying with your children\nYou can add children to your application as dependants if both of the following apply:\n• they are under 18 when you apply, or were under 18 when they were ﬁrst granted leave\n• they do not live an independent life\nYour child is living an independent life if, for example, they have left home, got married and had\nchildren.\nWhen you can settle permanently\nThe earliest you can apply to settle in the UK (https://www.gov.uk/settle-in-the-uk) (called ‘indeﬁnite\nleave to remain’) is after you’ve lived in the UK for 5 years continuously on a family visa as a\npartner.\nYou cannot include time you’ve spent in the UK:\n• on any other visa\n• as a ﬁancé, ﬁancée or proposed civil partner\nThe rules are diﬀerent if you applied before 9 July 2012.", "metadata": {}}
{"id": "19", "text": "When you can settle permanently\nThe earliest you can apply to settle in the UK (https://www.gov.uk/settle-in-the-uk) (called ‘indeﬁnite\nleave to remain’) is after you’ve lived in the UK for 5 years continuously on a family visa as a\npartner.\nYou cannot include time you’ve spent in the UK:\n• on any other visa\n• as a ﬁancé, ﬁancée or proposed civil partner\nThe rules are diﬀerent if you applied before 9 July 2012.\nIf you applied before 9 July 2012\nYou can only extend your family visa if all the following are true:", "metadata": {}}
{"id": "20", "text": "• you were given permission to stay in the UK as a partner before 9 July 2012\n• you are not eligible to settle in the UK (/settle-in-the-uk)\n• you have not been granted or refused another visa\nYou must also prove that:\n• you have knowledge of English (/remain-in-uk-family/knowledge-of-english) \n• you and your partner have enough money to ﬁnancially support yourself and your dependants\nwithout relying on public funds (/government/publications/public-funds--2)\nCheck the information and evidence (/uk-family-visa/provide-information) you’ll need to prove your\nincome.\n3. Financial requirements if you’re applying as a\npartner or spouse\nIf you apply for a family visa as a partner, you and your partner usually need to prove that your\ncombined income is at least £29,000 a year.\nThis is called a ‘minimum income requirement’.", "metadata": {}}
{"id": "21", "text": "3. Financial requirements if you’re applying as a\npartner or spouse\nIf you apply for a family visa as a partner, you and your partner usually need to prove that your\ncombined income is at least £29,000 a year.\nThis is called a ‘minimum income requirement’.\nThe ﬁnancial requirements are diﬀerent if either:\n• your partner is getting certain disability or carer’s beneﬁts\n• you ﬁrst applied as a partner before 11 April 2024 and you’re extending that visa - this includes\nif you ﬁrst applied as a ﬁancé, ﬁancée or proposed civil partner\nHow you prove your income depends on how you got it. You may be able to use your savings\ninstead of income to show you meet the requirement.", "metadata": {}}
{"id": "22", "text": "Check the information and evidence (/uk-family-visa/provide-information) you’ll need to prove your\nincome.\nIf your partner is getting disability or carer’s beneﬁts\nYou do not need to meet a minimum income requirement if your partner gets one of the following\nbeneﬁts:\n• Disability Living Allowance\n• Scottish Adult Disability Living Allowance\n• Severe Disablement Allowance\n• Industrial Injuries Disablement Beneﬁt\n• Attendance Allowance\n• Pension Age Disability Payment\n• Carer’s Allowance\n• Carer Support Payment\n• Personal Independence Payment\n• Armed Forces Independence Payment or Guaranteed Income Payment under the Armed Forces\nCompensation Scheme\n• Constant Attendance Allowance, Mobility Supplement or War Disablement Pension under the\nWar Pensions Scheme\n• Police Injury Pension\n• Child Disability Payment\n• Adult Disability Payment", "metadata": {}}
{"id": "23", "text": "You need to show you and your family have enough money to house and support yourselves\nwithout relying on additional public funds (https://www.gov.uk/government/publications/public-funds--2).\nThe caseworker considers your income and housing costs.\nCheck the guidance in Appendix FM and Appendix HM armed forces: minimum income\nrequirement (/government/publications/chapter-8-appendix-fm-family-members) for more information.\nIf you ﬁrst applied as a partner before 11 April 2024 and you’re\nextending that visa\nIf you’re extending your stay with the same partner, you and your partner will need to prove that\nyour combined income is at least £18,600 a year.", "metadata": {}}
{"id": "24", "text": "Check the guidance in Appendix FM and Appendix HM armed forces: minimum income\nrequirement (/government/publications/chapter-8-appendix-fm-family-members) for more information.\nIf you ﬁrst applied as a partner before 11 April 2024 and you’re\nextending that visa\nIf you’re extending your stay with the same partner, you and your partner will need to prove that\nyour combined income is at least £18,600 a year.\nYou must prove you have extra money for any children who:\n• you’re applying for a family visa with\n• are already in the UK as dependants on your family visa\n• are already in the UK as your partner’s dependants\nYou do not need to prove you have extra money for any children who:\n• are British or Irish citizens\n• have pre-settled status\n• are permanently settled in the UK\nYou might not need to prove you have extra money if your children are citizens of the EU, Iceland,\nLiechtenstein, Norway or Switzerland and they do not have pre-settled status or are not\npermanently settled in the UK.", "metadata": {}}
{"id": "25", "text": "Check the guidance in Appendix FM and Appendix HM armed\nforces: minimum income requirement (/government/publications/chapter-8-appendix-fm-family-members)", "metadata": {}}
{"id": "26", "text": "for more information.\nIf you need to prove extra money for children, you’ll need to prove an extra:\n• £3,800 a year for the ﬁrst child\n• £2,400 a year for each additional child you have after the ﬁrst child\nIf the total amount you’d need to earn based on your children would be more than £29,000, you\nonly need to prove you make £29,000 a year.", "metadata": {}}
{"id": "27", "text": "If you cannot meet the ﬁnancial requirements\nIf you cannot meet these ﬁnancial requirements you may still be able to apply for a visa or extend\nyour stay if:\n• you have a child in the UK who is a British or Irish citizen or has lived in the UK for 7 years and it\nwould be unreasonable for them to leave the UK\n• it would breach your human rights (https://www.equalityhumanrights.com/en/human-rights/what-are-\nhuman-rights) to stop you coming to the UK or make you leave\nIf you do not meet the ﬁnancial requirements, the earliest you’ll be able to apply to settle is after\n10 years in the UK.\n4. Apply as a parent\nYou can apply to live in the UK to care for your child.\nIf you’re eligible to apply as a partner (/uk-family-visa/partner-spouse), you must do that instead of", "metadata": {}}
{"id": "28", "text": "applying as a parent.\nYour child must either:\n• be under 18 on the date you apply\n• have been under 18 when you were ﬁrst granted leave\nYour child must:\n• live with you, unless they’re living away from home in full-time education - for example, at\nboarding school or university\n• not be married or in a civil partnership\nYour child must be living in the UK.", "metadata": {}}
{"id": "29", "text": "One of the following must also be true:\n• they’re a British or Irish citizen\n• they have settled in the UK - for example, they have indeﬁnite leave to remain, settled status or\nproof of permanent residence\n• they’re from the EU, Switzerland, Norway, Iceland or Liechtenstein and have pre-settled status (/\nsettled-status-eu-citizens-families/what-settled-and-presettled-status-means) - they must have started\nliving in the UK before 1 January 2021\n• if you’re applying in the UK, they must have lived in the UK for 7 years continuously and it would\nnot be reasonable for them to leave\nIf your child has settled or pre-settled status you may be able to apply to the free EU\nSettlement Scheme (/settled-status-eu-citizens-families/eligibility) or for an EU Settlement Scheme\nfamily permit (/family-permit).", "metadata": {}}
{"id": "30", "text": "Parental responsibility\nYou need to have sole or shared parental responsibility for your child.\nIf you share parental responsibility, the child’s other parent must not be your partner. They must\nalso either:\n• be a British or Irish citizen\n• have settled in the UK - for example, they have indeﬁnite leave to remain, settled status or proof\nof permanent residence\n• be from the EU, Switzerland, Norway, Iceland or Liechtenstein and have pre-settled status (/\nsettled-status-eu-citizens-families/what-settled-and-presettled-status-means) - they must have started\nliving in the UK before 1 January 2021\nIf the child lives with their other parent or carer, you must have access to the child in person, as\nagreed with the other parent or carer or by a court order.\nWhat you’ll need to prove\nYou must be able to prove that you’re taking an active role in your child’s upbringing and you plan\nto continue after you apply.", "metadata": {}}
{"id": "31", "text": "What you’ll need to prove\nYou must be able to prove that you’re taking an active role in your child’s upbringing and you plan\nto continue after you apply.\nSend evidence that:\n• comes from the government, school, court or a medical professional\n• shows you’re living with or caring for your child\n• is less than 4 years old", "metadata": {}}
{"id": "32", "text": "You can use things like:\n• a letter from your child’s school conﬁrming you take them to school or go to parent evenings\n• a letter to your address from the local council conﬁrming your child’s school\n• a letter from your child’s doctor, dentist, or health visitor conﬁrming that you take them to\nappointments\n• court order paperwork conﬁrming that your child lives with you or that you’re taking an active\nrole in their upbringing\nYou need permission from the court to use court order paperwork as evidence in your\napplication. Send written proof that the court has given you permission when you apply - for\nexample, a letter from the court.\nIf you do not have any evidence that meets this criteria, there is other evidence you can provide\ninstead. However, it’s less likely that you’ll be given a visa in this case.", "metadata": {}}
{"id": "33", "text": "Send written proof that the court has given you permission when you apply - for\nexample, a letter from the court.\nIf you do not have any evidence that meets this criteria, there is other evidence you can provide\ninstead. However, it’s less likely that you’ll be given a visa in this case.\nOther evidence you can provide includes:\n• a parental agreement drafted by a solicitor and signed by you and the child’s other parent\n• a letter from HMRC conﬁrming that you’re claiming Child T ax Credit\n• social services paperwork conﬁrming that you spend time with your child, or that you’re\napplying for access\nThings like greetings cards, photographs and text or social media messages are not considered\nstrong evidence of your role in your child’s upbringing and are unlikely to help your application.\nEnglish language and ﬁnancial requirements", "metadata": {}}
{"id": "34", "text": "You must also prove you:\n• have a good knowledge of English (/uk-family-visa/knowledge-of-english)\n• can ﬁnancially support yourself without claiming public funds\nThe caseworker uses your income and housing costs to check if you can support yourself.\nIf your child or any other dependants live with you, you must also prove you can ﬁnancially\nsupport them without claiming public funds.\nCheck the information and evidence (/uk-family-visa/provide-information) you’ll need to prove your\nincome.\nIf you do not meet the English language and ﬁnancial requirements you can still extend your\npermission to stay if:\n• your child in the UK is a British or Irish citizen or has lived in the UK for 7 years\n• it would be unreasonable for them to leave the UK\nHow long you can stay\nYou can stay in the UK for 2 years and 9 months on this visa. After this you’ll need to apply to\nextend your stay.\nIf you extend your family visa or switch to this visa you can stay in the UK for 2 years and 6\nmonths.", "metadata": {}}
{"id": "35", "text": "If you do not meet the English language and ﬁnancial requirements you can still extend your\npermission to stay if:\n• your child in the UK is a British or Irish citizen or has lived in the UK for 7 years\n• it would be unreasonable for them to leave the UK\nHow long you can stay\nYou can stay in the UK for 2 years and 9 months on this visa. After this you’ll need to apply to\nextend your stay.\nIf you extend your family visa or switch to this visa you can stay in the UK for 2 years and 6\nmonths.\nHow to apply", "metadata": {}}
{"id": "36", "text": "You’ll need to prepare information and evidence (/uk-family-visa/provide-information) to provide with\nyour application.\nHow you apply depends on whether you’re in the UK or not.\nOutside the UK\nYou must apply online outside the UK (https://visas-immigration.service.gov.uk/other-ooc). You must\nalso complete Appendix 5 (/government/publications/application-for-uk-visa-access-rights-to-child-\nappendix-5-form-vaf4a).\nIn the UK\nYou must apply online in the UK (https://visas-immigration.service.gov.uk/product/family-routes).\nRead the guidance for parents (/government/publications/chapter-8-appendix-fm-family-members)\nbefore applying.", "metadata": {}}
{"id": "37", "text": "How you apply depends on whether you’re in the UK or not.\nOutside the UK\nYou must apply online outside the UK (https://visas-immigration.service.gov.uk/other-ooc). You must\nalso complete Appendix 5 (/government/publications/application-for-uk-visa-access-rights-to-child-\nappendix-5-form-vaf4a).\nIn the UK\nYou must apply online in the UK (https://visas-immigration.service.gov.uk/product/family-routes).\nRead the guidance for parents (/government/publications/chapter-8-appendix-fm-family-members)\nbefore applying.\nIf you cannot pay the fee\nYou can apply for a fee waiver if you cannot pay the fee because you:\n• do not have a place to live and cannot aﬀord one\n• have a place to live but cannot aﬀord essential living costs like food or heating\n• have a very low income and paying the fee would harm your child’s wellbeing\nApply for a fee waiver online from outside the UK (https://visas-immigration.service.gov.uk/product/fee-", "metadata": {}}
{"id": "38", "text": "waiver).\nApply for a fee waiver online from inside the UK (https://www.gov.uk/visa-fee-waiver-in-uk).\nGet help to apply online\nYou can get help with completing the online visa application form (/assisted-digital-help-online-\napplications) if you:\n• do not feel conﬁdent using a computer or mobile device\n• do not have internet access\nYou can only use this service if you’re applying in the UK.\nYou cannot get immigration advice through this service.\nHow long it takes\nIf you apply outside the UK you’ll usually get a decision within 12 weeks.\nIf you apply inside the UK it currently takes about 12 months to get a decision.\nYou may be able to pay for a faster decision (/faster-decision-visa-settlement).\nApplying with other children\nYou can add other children to your application as dependants if one of the following applies:", "metadata": {}}
{"id": "39", "text": "• they are under 18 on the date you apply\n• they were under 18 when they were ﬁrst granted leave on a family visa\nThey must also:\n• live with you, unless they’re living away from home in full-time education - for example, at\nboarding school or university\n• not be married or in a civil partnership\nWhen you can settle permanently\nThe earliest you can apply to settle in the UK (https://www.gov.uk/settle-in-the-uk) (called ‘indeﬁnite\nleave to remain’) is after you’ve lived in the UK for 5 years continuously on a family visa as a\nparent.\nYou cannot include time you’ve spent in the UK on any other visa.\nThe rules are diﬀerent if you applied before 9 July 2012.\n5. Apply as a child\nYou can apply for a family visa to join your parent in the UK.\nYou may not need a family visa if at least one of your parents has indeﬁnite leave to remain or\nproof of permanent residence.", "metadata": {}}
{"id": "40", "text": "You cannot include time you’ve spent in the UK on any other visa.\nThe rules are diﬀerent if you applied before 9 July 2012.\n5. Apply as a child\nYou can apply for a family visa to join your parent in the UK.\nYou may not need a family visa if at least one of your parents has indeﬁnite leave to remain or\nproof of permanent residence. Check if you can apply to settle in the UK (/settle-in-the-uk).\nIf your parent cannot include you in their form and you’re in the UK, you may be eligible to apply\nfor Private Life in the UK (/uk-family-visa/private-life).", "metadata": {}}
{"id": "41", "text": "If your parent has settled or pre-settled status under the EU Settlement Scheme you may be able\nto apply to the free EU Settlement Scheme (https://www.gov.uk/family-permit).\nYou were born in the UK\nYou’ll get the same permission to stay as your parent if you were born in the UK.\nYou can either:\n• be added to your parent’s next application as a dependant\n• apply separately\nYou must:\n• live with your parent in the UK, unless you’re living away from home in full-time education - for\nexample, at boarding school or university\n• not be married or in a civil partnership\nIf you’re under 18, you’ll need to know what kind of permission to stay in the UK (‘limited leave to\nremain’) your parent has.\nIf you’re 18 or over, you can only apply if you have permission to stay in the UK (‘leave to enter or\nremain’) which started when you were under 18. They must also apply from inside the UK.\nYou were born outside the UK\nWhether you can apply depends on your age and how your parent applied.", "metadata": {}}
{"id": "42", "text": "If you’re 18 or over, you can only apply if you have permission to stay in the UK (‘leave to enter or\nremain’) which started when you were under 18. They must also apply from inside the UK.\nYou were born outside the UK\nWhether you can apply depends on your age and how your parent applied.\nYou must:", "metadata": {}}
{"id": "43", "text": "• live with your parent, unless you’re living away from home in full-time education - for example,\nat boarding school or university\n• not be married or in a civil partnership\nIf you’re under 18\nOne of your parents must be applying or have applied for a visa or to extend their permission to\nstay as a:\n• partner - and the partner they’re joining is your other parent\n• parent - and they have sole parental responsibility for you\nYou can also apply if your parent has protection status (permission to stay as a refugee or person\nwith humanitarian protection).\nOtherwise, you might still be eligible to apply if there are serious reasons to let you come to or\nstay in the UK and there are plans for your care.\nIf you’re 18 or over\nYour parent can include you in their application as a dependant, or you can apply separately\nyourself.\nYou can only apply if you have permission to stay in the UK (‘leave to remain’) on a family visa\nwhich started when you were under 18.", "metadata": {}}
{"id": "44", "text": "Otherwise, you might still be eligible to apply if there are serious reasons to let you come to or\nstay in the UK and there are plans for your care.\nIf you’re 18 or over\nYour parent can include you in their application as a dependant, or you can apply separately\nyourself.\nYou can only apply if you have permission to stay in the UK (‘leave to remain’) on a family visa\nwhich started when you were under 18.\nIf you apply separately from your parent\nYou’ll need to include proof of your parent’s income when you apply.", "metadata": {}}
{"id": "45", "text": "If your parent has a family visa\nTheir income has to meet the ﬁnancial requirement for their type of family visa. For example, if\nthey have a family visa as a partner, you’ll need to include proof they can meet the ﬁnancial\nrequirement for partners (/uk-family-visa/proof-income-partner).\nIf your parent has permission to stay as a refugee or person with humanitarian\nprotection\nYou’ll need to include proof your parent can meet the ﬁnancial requirement for partners (/uk-family-\nvisa/proof-income-partner), whether they have a partner or not.\nApply from outside the UK\nYou’ll need to prepare information and evidence (/uk-family-visa/provide-information) to provide with\nyour application.", "metadata": {}}
{"id": "46", "text": "If your parent has permission to stay as a refugee or person with humanitarian\nprotection\nYou’ll need to include proof your parent can meet the ﬁnancial requirement for partners (/uk-family-\nvisa/proof-income-partner), whether they have a partner or not.\nApply from outside the UK\nYou’ll need to prepare information and evidence (/uk-family-visa/provide-information) to provide with\nyour application.\nApply at the same time as your parent\nWhich form you need to ﬁll in depends on whether your parent is applying to enter the UK as the\npartner of one of the following:\n• a British or Irish citizen\n• a person with indeﬁnite leave to remain\n• a person settled in the UK - for example, they have indeﬁnite leave to remain, settled status or\nproof of permanent residence\n• a person from the EU, Switzerland, Norway, Iceland or Liechtenstein who has pre-settled status (/", "metadata": {}}
{"id": "47", "text": "settled-status-eu-citizens-families/what-settled-and-presettled-status-means) - they must have started\nliving in the UK before 1 January 2021\n• a person with a T urkish Businessperson visa (/turkish-business-person) or T urkish Worker visa (/\nturkish-worker)\n• a person with protection status (leave to remain as a refugee, permission to stay as a refugee or\na person with humanitarian protection)\nIf they are applying as one of these, you must ﬁll in the Appendix FM online form (https://visas-\nimmigration.service.gov.uk/apply-visa-type/appendixfm).\nIf they are not, you must ﬁll in both:\n• the online application form (https://visas-immigration.service.gov.uk/other-ooc?", "metadata": {}}
{"id": "48", "text": "_ga=2.11060468.1141308389.1579530361-1585310190.1577696564)\n• the Appendix 1 paper form (/government/publications/application-for-visa-family-settlement-or-reunion-\nform-appendix-1-vaf4a)\nApply separately\nWhich form you need to ﬁll in depends on whether your parent has leave to enter or remain in the\nUK on a 5 or 10-year route to settlement as the partner of:\n• a British or Irish citizen\n• a person with indeﬁnite leave to remain\n• a person settled in the UK - for example, they have indeﬁnite leave to remain, settled status or\nproof of permanent residence\n• a person from the EU, Switzerland, Norway, Iceland or Liechtenstein who has pre-settled status (/\nsettled-status-eu-citizens-families/what-settled-and-presettled-status-means) - they must have started", "metadata": {}}
{"id": "49", "text": "living in the UK before 1 January 2021\n• a person with a T urkish Businessperson visa (/turkish-business-person) or T urkish Worker visa (/\nturkish-worker)\n• a person with protection status (leave to remain as a refugee, permission to stay as a refugee or\na person with humanitarian protection)\nIf they do, you must ﬁll in the Appendix FM online form (https://visas-immigration.service.gov.uk/apply-\nvisa-type/appendixfm).\nIf they do not, you must ﬁll in both:\n• the online application form (https://visas-immigration.service.gov.uk/other-ooc?\n_ga=2.11060468.1141308389.1579530361-1585310190.1577696564)\n• the Appendix 1 paper form (/government/publications/application-for-visa-family-settlement-or-reunion-\nform-appendix-1-vaf4a)\nApply from the UK\nYou’ll need to prepare information and evidence (/uk-family-visa/provide-information) to provide with\nyour application.", "metadata": {}}
{"id": "50", "text": "If they do not, you must ﬁll in both:\n• the online application form (https://visas-immigration.service.gov.uk/other-ooc?\n_ga=2.11060468.1141308389.1579530361-1585310190.1577696564)\n• the Appendix 1 paper form (/government/publications/application-for-visa-family-settlement-or-reunion-\nform-appendix-1-vaf4a)\nApply from the UK\nYou’ll need to prepare information and evidence (/uk-family-visa/provide-information) to provide with\nyour application.\nIf you’re already in the UK, you must apply online (https://visas-immigration.service.gov.uk/product/\nfamily-routes).\nYou can also check if you’re eligible for a diﬀerent type of visa (/check-uk-visa).\nIf you cannot pay the fee\nYou can apply for a fee waiver if you cannot pay the fee because you:", "metadata": {}}
{"id": "51", "text": "• do not have a place to live and cannot aﬀord one\n• have a place to live but cannot aﬀord essential living costs like food or heating\n• have a very low income and paying the fee would harm your child’s wellbeing\nApply for a fee waiver online from outside the UK (https://visas-immigration.service.gov.uk/product/fee-\nwaiver). You can only apply for a visa fee waiver if you’re ﬁlling in the Appendix FM online form\n(https://visas-immigration.service.gov.uk/apply-visa-type/appendixfm).\nApply for a fee waiver online from inside the UK (https://www.gov.uk/visa-fee-waiver-in-uk).\nHow long it takes\nHow long it takes to get a decision depends on whether you apply from outside or inside the UK.\nYou may be able to pay for a faster decision (https://www.gov.uk/faster-decision-visa-settlement).\nIf you apply outside the UK\nYou’ll usually get a decision within 12 weeks.", "metadata": {}}
{"id": "52", "text": "Apply for a fee waiver online from inside the UK (https://www.gov.uk/visa-fee-waiver-in-uk).\nHow long it takes\nHow long it takes to get a decision depends on whether you apply from outside or inside the UK.\nYou may be able to pay for a faster decision (https://www.gov.uk/faster-decision-visa-settlement).\nIf you apply outside the UK\nYou’ll usually get a decision within 12 weeks.\nIf you apply inside the UK\nYou’ll usually get a decision within 8 weeks.\nIt takes about 12 months to get a decision if your parent has leave to enter or remain in the UK on\nthe 10-year route to settlement. \nYour parent’s decision letter will say if they’re on the 5-year or 10-year route to settlement.", "metadata": {}}
{"id": "53", "text": "If you’re extending your family visa as a child, your previous decision letter will also say which\nroute you’re both on.\nGet help to apply online\nYou can get help with completing the online visa application form (/assisted-digital-help-online-\napplications) if you:\n• do not feel conﬁdent using a computer or mobile device\n• do not have internet access\nYou can only use this service if you’re applying in the UK.\nYou cannot get immigration advice through this service.\n6. Apply as an adult coming to be cared for by a\nrelative\nYou must need long-term care from a parent, grandchild, brother, sister, son or daughter who is\nliving permanently in the UK.\nYou can only apply from outside the UK, unless you’re applying to extend your stay on this visa.\nOne of the following must also apply to the relative:\n• they’re a British or Irish citizen\n• they have settled in the UK - for example, they have indeﬁnite leave to remain, settled status or", "metadata": {}}
{"id": "54", "text": "proof of permanent residence\n• they’re from the EU, Switzerland, Norway, Iceland or Liechtenstein and have pre-settled status (/\nsettled-status-eu-citizens-families/what-settled-and-presettled-status-means) - they must have started\nliving in the UK before 1 January 2021\n• they have protection status (leave to remain as a refugee, permission to stay as a refugee or a\nperson with humanitarian protection) in the UK\nIf your family member has settled or pre-settled status you may be able to apply to the free EU\nSettlement Scheme (/settled-status-eu-citizens-families/eligibility).", "metadata": {}}
{"id": "55", "text": "What you’ll need to prove\nYou must prove:\n• you need long-term care to do everyday personal and household tasks because of illness,\ndisability or your age\n• you’re 18 or over\n• the care you need is not available or aﬀordable in the country you live in\nYou must also prove the relative you’re joining in the UK can accommodate and care for you for\neither:\n• the whole time your relative has permission to stay in the UK\n• 5 years, if your relative is a British citizen or settled in the UK\nThey must have enough money to support you without relying on public funds (/government/\npublications/public-funds--2). The caseworker considers their income, housing costs and any care", "metadata": {}}
{"id": "56", "text": "costs.\nCheck the information and evidence (/uk-family-visa/provide-information) you’ll need to prove your\nrelative’s income.\nHow long you can stay for\nHow long you can stay depends on the status of your family member.\nIf your family member is British, Irish or settled in the UK\nYour stay is unlimited. You will not need to apply to extend or settle.\nIf your family member has pre-settled status\nThey must have started living in the UK before 1 January 2021. You can stay as long as your family\nmember stays. You’ll need to apply to extend or settle when they do.\nIf your family member has protection status (leave to remain as a refugee, permission\nto stay as a refugee or a person with humanitarian protection) in the UK\nYou can stay as long as your family member stays. You’ll need to apply to extend or settle when\nthey do.\nHow to apply\nYou’ll need to prepare information and evidence (/uk-family-visa/provide-information) to provide with\nyour application.", "metadata": {}}
{"id": "57", "text": "You must apply as an adult dependent relative online (https://visas-immigration.service.gov.uk/other-\nooc) and complete Appendix 1 (/government/publications/application-for-visa-family-settlement-or-reunion-\nform-appendix-1-vaf4a).\nApply to extend your stay\nApply online to extend your stay in the UK (https://visas-immigration.service.gov.uk/product/ﬂr-hro).\nHow long it takes\nIf you apply outside the UK you’ll usually get a decision within 12 weeks.\nIf you apply inside the UK you’ll usually get a decision within 8 weeks.\n7. Apply on the basis of your private life\nYou can only apply on the basis of your private life if you’re already living in the UK.", "metadata": {}}
{"id": "58", "text": "How long it takes\nIf you apply outside the UK you’ll usually get a decision within 12 weeks.\nIf you apply inside the UK you’ll usually get a decision within 8 weeks.\n7. Apply on the basis of your private life\nYou can only apply on the basis of your private life if you’re already living in the UK.\nYou must be able to prove that you:\n• are under 18 and you’ve lived in the UK continuously for at least 7 years, and it would be\nunreasonable to expect you to leave the UK\n• are between 18 and 24 and you’ve lived continuously in the UK for more than half your life\n• are 18 or over, have spent less than 20 years in the UK and would have very signiﬁcant\nproblems living in the country you’d have to go to\n• have been in the UK continuously for 20 years\n• were born in the UK to a person who has permission to stay in the UK on the basis of their", "metadata": {}}
{"id": "59", "text": "private life, or is applying for it\nYour family members can apply on the same application - you’ll be considered separately.\nHow to apply\nYou must apply online (https://visas-immigration.service.gov.uk/product/family-routes).\nYou’ll need to prepare information and evidence (/uk-family-visa/provide-information) to provide with\nyour application.\nIf you cannot pay the application fee\nApply for a fee waiver online (https://visas-immigration.service.gov.uk/product/fee-waiver) if you cannot\naﬀord to pay the fee because you:\n• do not have a place to live and you cannot aﬀord one\n• have a place to live but cannot aﬀord your essential living costs like food or heating\n• have a very low income and paying the fee would harm your child’s wellbeing\nHow long it takes\nIt currently takes about 12 months to get a decision.\nYou may be able to pay for a faster decision (/faster-decision-visa-settlement).\nHow long you can stay", "metadata": {}}
{"id": "60", "text": "You can stay in the UK for 2 years and 6 months on this visa.\nYou can apply to stay for 5 years instead if you’re:\n• under 18 and have lived in the UK continuously for at least 7 years\n• aged between 18 and 24 and have spent half your life in the UK\nWhen you can settle\nYou can settle after 5 years if you’re either:\n• under 18 and have lived in the UK continuously for at least 7 years\n• aged between 18 and 24 and have spent half your life in the UK\nYou can settle after 10 years if you’re either:\n• 18 or over, have spent less than 20 years in the UK and would have very signiﬁcant problems\nliving in the country you’d have to go to\n• born in the UK to a person who has permission to stay in the UK on the basis of their private life,\nor is applying for it\nIf you’re extending your visa\nYou can extend for 2 years and 6 months.", "metadata": {}}
{"id": "61", "text": "Get help using a computer to apply online\nYou can get help with completing the online visa application form (/assisted-digital-help-online-", "metadata": {}}
{"id": "62", "text": "applications) if you:\n• do not feel conﬁdent using a computer or mobile device\n• do not have internet access\nYou can only use this service if you’re applying in the UK.\nYou cannot get immigration advice through this service.\n8. Information and evidence you must provide\nYou’ll need to have information and some evidence ready when you make your application. Include\ninformation for you and any dependants applying at the same time.\nYou’ll need to provide:\n• all your names\n• your date of birth\n• your current passport or other valid travel ID\n• copies of the photo page and any visa or entry stamps in your previous passports\n• details of any previous immigration applications you’ve made\n• details of any criminal convictions\n• your national insurance number, if you have one\n• your parents’ date of birth and nationality if you’re applying from outside the UK\n• your tuberculosis test results (/tb-test-visa) if you’re from a country where you have to take the", "metadata": {}}
{"id": "63", "text": "test\n• a certiﬁed translation (/certifying-a-document) of any document that is not in English or Welsh\nYou’ll also need to provide either:\n• your biometric residence permit (BRP) - you can use it for 18 months after the expiry date\nprinted on the card\n• online proof of your immigration status if you have an eVisa -  you’ll need to get a share code (/\nview-prove-immigration-status)\nYou’ll need an email address to make an online application.\nYou’ll also need to:\n• prove your knowledge of English (/uk-family-visa/knowledge-of-english)\n• give proof of your ﬁnances, if you’re not applying on the basis of your private life\nYou may need to provide other additional documents depending on your circumstances - for\nexample a sponsorship form (/government/publications/sponsor-a-visa-applicant-form-su07) from your\nfamily member in the UK.\nYou’ll be told how to provide your documents when you apply.", "metadata": {}}
{"id": "64", "text": "You’ll also need to:\n• prove your knowledge of English (/uk-family-visa/knowledge-of-english)\n• give proof of your ﬁnances, if you’re not applying on the basis of your private life\nYou may need to provide other additional documents depending on your circumstances - for\nexample a sponsorship form (/government/publications/sponsor-a-visa-applicant-form-su07) from your\nfamily member in the UK.\nYou’ll be told how to provide your documents when you apply.\nYour ﬁnances\nYou’ll need to show you can meet the ﬁnancial requirements for the type of family visa you’re\napplying for.", "metadata": {}}
{"id": "65", "text": "This is based on your income or the income of the family member you’re joining in the UK, or\nboth. \nFor example, you’ll need to prove your own and your partner’s combined UK income in your\napplication if you’re applying as a partner. If you’re applying as a child, you’ll need to prove the\nincome of the parent (or parents) you’re joining.\nWhat counts as income\nThe following things can count as income: \n• income from employment before tax and National Insurance (from P60 or payslips) - you can\nonly use income earned in the UK\n• income earned from self-employment or as a director of a limited company in the UK - this will\nbe on a Self Assessment tax return\n• cash savings above £16,000\n• money from a pension\n• non-work income, for example from property rentals or dividends\nIf you or your family member are self-employed, you need to base your income on how much you\nearned in the last 6 months or more, counting back from the day you apply.", "metadata": {}}
{"id": "66", "text": "Proof of your ﬁnances\nYou’ll need to provide proof of the income with your application. \nIf you or your family member are employed, you could include:\n• bank statements showing your or their income", "metadata": {}}
{"id": "67", "text": "• 6 months of payslips, counting back from the day you apply\n• a letter from an employer, dated and on headed paper\nThe employer’s letter should conﬁrm:\n• you or your family member are employed there\n• the job title or position you or your family member hold\n• how long you or your family member have worked there\n• the type of contract (for example, permanent, ﬁxed term)\n• what you or your family member earn before tax and National Insurance\n• how long you or your family member have been paid your current salary\n• the payslips are genuine\nYou’ll be told exactly what documents to provide when you apply online.", "metadata": {}}
{"id": "68", "text": "You’ll need to follow extra guidance if:\n• you or your family member’s income is not from employment, for example it’s from running a\nlimited company, savings, or a pension\n• you or your family member have taken maternity or paternity leave in the last 6 months\n• you want to combine diﬀerent income sources\nCheck the guidance in:\n• Appendix FM and Appendix HM armed forces: minimum income requirement (/government/\npublications/chapter-8-appendix-fm-family-members/appendix-fm-17-ﬁnancial-requirement-accessible-\nversion) if you’re applying as a partner", "metadata": {}}
{"id": "69", "text": "• Appendix FM and adult dependent relatives: maintenance and accommodation (/government/\npublications/chapter-8-appendix-fm-family-members/appendix-fm-17a-maintenance-accessible-version) if\nyou’re applying as a parent or an adult coming to be cared for by a relative\nIf you’re applying as a child, check the guidance for the type of application your parent is\nmaking.\nThe detailed guidance also explains the evidence you need to provide for each of the types of\nincome you’re relying on.\nYour partner’s details\nIf you have a partner, you’ll be asked about their:\n• name\n• date of birth\n• nationality\n• passport\n• right to be in the UK, for example they’re a British citizen\nYou’ll also need to give details of:\n• any people your partner was previously married to, in a civil partnership with or had children\nwith\n• evidence of marriages ending, for example a divorce certiﬁcate\n• anyone your partner supports with money, for example their parents", "metadata": {}}
{"id": "70", "text": "Proof of relationship\nIf you’re applying as a spouse or partner, you’ll be asked about:\n• your relationship with your partner, for example how you met and how often you see each other\n• how long you’ve lived together - you’ll need to provide proof like council tax bills\n• things you pay for together\n• whether you’re your partner’s carer\nYour previous partners\nYou’ll need to include details of anyone you previously married or had children with. Include\nevidence of marriages ending, for example a divorce certiﬁcate.\nChildren\nYou’ll need to give details of your children (and your partner’s children if you have one). You’ll be\nasked about all children, even if they’re not applying.\nYou’ll need to give details of:\n• their name\n• their nationality\n• their date of birth\n• their passport details", "metadata": {}}
{"id": "71", "text": "• who the child normally lives with\n• any other people with parental responsibility for your child, for example your step children’s\nother parents\n• how you’re involved in their day to day life\n• arrangements you have to see the child - for example the courts have granted you access\n• the child’s extended family\n• any countries your child has visited or lived in\nYour life outside the UK\nYou’ll need to give details of:\n• countries outside the UK you’ve lived in and visited\n• family and friends in the countries where you were born or have nationality\n9. Knowledge of English\nYou may need to prove your knowledge of the English language when you apply.\nWho does not need to prove their knowledge of English\nYou do not need to prove your knowledge of English or take a test if one of the following is true:\n• you’re applying as a child\n• you’re applying as an adult coming to be cared for by a relative", "metadata": {}}
{"id": "72", "text": "• you’ve been in the UK on a family visa for 5 years and you’re extending it as a partner or parent\n• you’re over 65\n• you have a physical or mental condition that prevents you from meeting the requirement\nYou also will not need to prove your knowledge of English if you’re a national of one of the\nfollowing countries or territories:\n• Antigua and Barbuda\n• Australia\n• the Bahamas\n• Barbados\n• Belize\n• the British overseas territories\n• Canada\n• Dominica\n• Grenada\n• Guyana\n• Jamaica\n• Malta\n• New Zealand\n• St Kitts and Nevis\n• St Lucia\n• St Vincent and the Grenadines", "metadata": {}}
{"id": "73", "text": "• Trinidad and T obago\n• USA\nHow to prove your knowledge of English\nYou can prove it in one of the following ways:\n• having a degree from a UK institution\n• having a degree from an institution that was outside the UK and taught in English\n• passing an English test from an approved provider\nIf you have already proved your knowledge of English in a previous successful visa application, you\nmay not have to prove it again.\nIf you have a degree from a UK institution\nYou can prove your knowledge of English if you have a degree-level qualiﬁcation that was both:\n• taught in English\n• awarded by a UK institution, even if you studied outside the UK\nIf your qualiﬁcation is from a UK institution, you only need your degree certiﬁcate.\nIf you have a degree from an institution outside the UK\nIf your degree was taught in English and was not awarded by a UK institution, you’ll need to apply\nfor an assessment from Ecctis (https://qls.ecctis.com/).", "metadata": {}}
{"id": "74", "text": "Ecctis will give you a code to conﬁrm that your qualiﬁcation is equivalent to a UK bachelor’s\ndegree or higher and was taught in English.\nIf you have already been assessed by Ecctis, you do not need to reapply. You can use the\ncertiﬁcate from your previous assessment instead.\nPassing an English test\nIf you do not have any qualiﬁcations that prove your knowledge of English, you will need to pass a\nSecure English Language T est (SELT) (/guidance/prove-your-english-language-abilities-with-a-secure-\nenglish-language-test-selt) with an approved provider.\nYou must pass at least level A1 on the Common European Framework of Reference for Languages\n(CEFR) scale (https://www.coe.int/en/web/common-european-framework-reference-languages/table-1-\ncefr-3.3-common-reference-levels-global-scale) for your ﬁrst visa application. You can choose to take a\nhigher level test.", "metadata": {}}
{"id": "75", "text": "You must pass at least level A1 on the Common European Framework of Reference for Languages\n(CEFR) scale (https://www.coe.int/en/web/common-european-framework-reference-languages/table-1-\ncefr-3.3-common-reference-levels-global-scale) for your ﬁrst visa application. You can choose to take a\nhigher level test.\nIf you pass level B1 or higher, you can use your test result again when you apply for settlement\nafter 5 years. Your test still needs to be on the approved list of qualiﬁcations (https://draft-\norigin.publishing.service.gov.uk/english-language/approved-english-language-qualiﬁcations) and your test\ncertiﬁcate must not have been withdrawn by the test provider.\nApplying to extend your visa after 2.5 years\nYou may have to pass a higher CEFR level if you want to stay in the UK after 2.5 years. What you\nneed to do depends on what CEFR level you passed for your ﬁrst visa.", "metadata": {}}
{"id": "76", "text": "Your test still needs to be on the approved list of qualiﬁcations (https://draft-\norigin.publishing.service.gov.uk/english-language/approved-english-language-qualiﬁcations) and your test\ncertiﬁcate must not have been withdrawn by the test provider.\nApplying to extend your visa after 2.5 years\nYou may have to pass a higher CEFR level if you want to stay in the UK after 2.5 years. What you\nneed to do depends on what CEFR level you passed for your ﬁrst visa.\nIf you passed:\n• level A1, you’ll need to pass at least level A2 in speaking and listening", "metadata": {}}
{"id": "77", "text": "• level A2, B1, B2, C1 or C2, you can use the test result again for your application as long as your\ntest certiﬁcate has not been withdrawn by the test provider\nIf you were given an exemption, you’ll need to pass a test at level A1.\nRead the English language requirement: family members guidance (https://www.gov.uk/government/\npublications/english-language-requirement-family-members).\n10. After you apply\nYou’ll need to attend an appointment to provide your ﬁngerprints and a photo (biometric\ninformation). You’ll be told how to make an appointment when you apply.\nGetting your documents back\nYou can ask for your passport and other documents to be returned (/visa-documents-returned) if\nyou’ve provided them with your application but need them urgently.\nYou might have to cancel your application to get your documents back.\nIf your application is approved\nYou’ll get an eVisa (an online record of your immigration status).\nYour decision email or letter will tell you how to get access to your eVisa (/get-access-evisa).", "metadata": {}}
{"id": "78", "text": "You’ll be told how to make an appointment when you apply.\nGetting your documents back\nYou can ask for your passport and other documents to be returned (/visa-documents-returned) if\nyou’ve provided them with your application but need them urgently.\nYou might have to cancel your application to get your documents back.\nIf your application is approved\nYou’ll get an eVisa (an online record of your immigration status).\nYour decision email or letter will tell you how to get access to your eVisa (/get-access-evisa). You’ll\nneed to create a UKVI account.\nYou can:", "metadata": {}}
{"id": "79", "text": "• work\n• study\nYou cannot:\n• usually get beneﬁts or other public funds for you or your dependants\n• apply to settle in the UK (/settle-in-the-uk) until you’re eligible\nIf you applied as a ﬁancé, ﬁancée or proposed civil partner\nYou cannot work or study in the UK.\nYou’ll need to apply for permission to extend your stay in the UK when you marry or enter into a\ncivil partnership. If your application is approved, you will have the right to work or study in the UK.", "metadata": {}}
{"id": "80", "text": "All content is available under the Open Government Licence v3.0, except where otherwise stated © Crown copyright", "metadata": {}}
